MikroElektronika/core_packages/PIC/XC8/def/PIC18F4685/mcu.h
// Register: CANCON_RO6
#define CANCON_RO6 CANCON_RO6
extern volatile unsigned char           CANCON_RO6          __at(0xE5F);
#ifndef _LIB_BUILD
asm("CANCON_RO6 equ 0E5Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FP0                    :1;
        unsigned WIN0_FP1               :1;
        unsigned WIN1_FP2               :1;
        unsigned WIN2_FP3               :1;
        unsigned ABAT                   :1;
        unsigned REQOP0                 :1;
        unsigned REQOP1                 :1;
        unsigned REQOP2                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned WIN0                   :1;
        unsigned WIN1                   :1;
        unsigned WIN2                   :1;
    };
} CANCON_RO6bits_t;
extern volatile CANCON_RO6bits_t CANCON_RO6bits __at(0xE5F);
// bitfield macros
#define _CANCON_RO6_FP0_POSN                                0x0
#define _CANCON_RO6_FP0_POSITION                            0x0
#define _CANCON_RO6_FP0_SIZE                                0x1
#define _CANCON_RO6_FP0_LENGTH                              0x1
#define _CANCON_RO6_FP0_MASK                                0x1
#define _CANCON_RO6_WIN0_FP1_POSN                           0x1
#define _CANCON_RO6_WIN0_FP1_POSITION                       0x1
#define _CANCON_RO6_WIN0_FP1_SIZE                           0x1
#define _CANCON_RO6_WIN0_FP1_LENGTH                         0x1
#define _CANCON_RO6_WIN0_FP1_MASK                           0x2
#define _CANCON_RO6_WIN1_FP2_POSN                           0x2
#define _CANCON_RO6_WIN1_FP2_POSITION                       0x2
#define _CANCON_RO6_WIN1_FP2_SIZE                           0x1
#define _CANCON_RO6_WIN1_FP2_LENGTH                         0x1
#define _CANCON_RO6_WIN1_FP2_MASK                           0x4
#define _CANCON_RO6_WIN2_FP3_POSN                           0x3
#define _CANCON_RO6_WIN2_FP3_POSITION                       0x3
#define _CANCON_RO6_WIN2_FP3_SIZE                           0x1
#define _CANCON_RO6_WIN2_FP3_LENGTH                         0x1
#define _CANCON_RO6_WIN2_FP3_MASK                           0x8
#define _CANCON_RO6_ABAT_POSN                               0x4
#define _CANCON_RO6_ABAT_POSITION                           0x4
#define _CANCON_RO6_ABAT_SIZE                               0x1
#define _CANCON_RO6_ABAT_LENGTH                             0x1
#define _CANCON_RO6_ABAT_MASK                               0x10
#define _CANCON_RO6_REQOP0_POSN                             0x5
#define _CANCON_RO6_REQOP0_POSITION                         0x5
#define _CANCON_RO6_REQOP0_SIZE                             0x1
#define _CANCON_RO6_REQOP0_LENGTH                           0x1
#define _CANCON_RO6_REQOP0_MASK                             0x20
#define _CANCON_RO6_REQOP1_POSN                             0x6
#define _CANCON_RO6_REQOP1_POSITION                         0x6
#define _CANCON_RO6_REQOP1_SIZE                             0x1
#define _CANCON_RO6_REQOP1_LENGTH                           0x1
#define _CANCON_RO6_REQOP1_MASK                             0x40
#define _CANCON_RO6_REQOP2_POSN                             0x7
#define _CANCON_RO6_REQOP2_POSITION                         0x7
#define _CANCON_RO6_REQOP2_SIZE                             0x1
#define _CANCON_RO6_REQOP2_LENGTH                           0x1
#define _CANCON_RO6_REQOP2_MASK                             0x80
#define _CANCON_RO6_WIN0_POSN                               0x1
#define _CANCON_RO6_WIN0_POSITION                           0x1
#define _CANCON_RO6_WIN0_SIZE                               0x1
#define _CANCON_RO6_WIN0_LENGTH                             0x1
#define _CANCON_RO6_WIN0_MASK                               0x2
#define _CANCON_RO6_WIN1_POSN                               0x2
#define _CANCON_RO6_WIN1_POSITION                           0x2
#define _CANCON_RO6_WIN1_SIZE                               0x1
#define _CANCON_RO6_WIN1_LENGTH                             0x1
#define _CANCON_RO6_WIN1_MASK                               0x4
#define _CANCON_RO6_WIN2_POSN                               0x3
#define _CANCON_RO6_WIN2_POSITION                           0x3
#define _CANCON_RO6_WIN2_SIZE                               0x1
#define _CANCON_RO6_WIN2_LENGTH                             0x1
#define _CANCON_RO6_WIN2_MASK                               0x8

// Register: B4CON
#define B4CON B4CON
extern volatile unsigned char           B4CON               __at(0xE60);
#ifndef _LIB_BUILD
asm("B4CON equ 0E60h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FILHIT0_TXPRI0         :1;
        unsigned FILHIT1_TXPRI1         :1;
        unsigned FILHIT2_RTREN          :1;
        unsigned FILHIT3_TXREQ          :1;
        unsigned FILHIT4_TXERR          :1;
        unsigned RXRTRRO_TXLARB         :1;
        unsigned RXM1_TXABT             :1;
        unsigned RXFUL_TXBIF            :1;
    };
    struct {
        unsigned FILHIT0                :1;
        unsigned FILHIT1                :1;
        unsigned FILHIT2                :1;
        unsigned FILHIT3                :1;
        unsigned FILHIT4                :1;
        unsigned RTRRO                  :1;
        unsigned RXM1                   :1;
        unsigned RXFUL                  :1;
    };
    struct {
        unsigned TXPRI0                 :1;
        unsigned TXPRI1                 :1;
        unsigned RTREN                  :1;
        unsigned TXREQ                  :1;
        unsigned TXERR                  :1;
        unsigned TXLARB                 :1;
        unsigned TXABT                  :1;
        unsigned TXBIF                  :1;
    };
    struct {
        unsigned                        :5;
        unsigned RXRTRRO                :1;
    };
    struct {
        unsigned B4FILHIT0              :1;
        unsigned B4FILHIT1              :1;
        unsigned B4FILHIT2              :1;
        unsigned B4FILHIT3              :1;
        unsigned B4FILHIT4              :1;
        unsigned B4RTRRO                :1;
        unsigned B4RXM1                 :1;
        unsigned B4RXFUL                :1;
    };
    struct {
        unsigned B4TXPRI0               :1;
        unsigned B4TXPRI1               :1;
        unsigned B4RTREN                :1;
        unsigned B4TXREQ                :1;
        unsigned B4TXERR                :1;
        unsigned B4TXLARB               :1;
        unsigned B4TXABT                :1;
        unsigned B4TXB3IF               :1;
    };
} B4CONbits_t;
extern volatile B4CONbits_t B4CONbits __at(0xE60);
// bitfield macros
#define _B4CON_FILHIT0_TXPRI0_POSN                          0x0
#define _B4CON_FILHIT0_TXPRI0_POSITION                      0x0
#define _B4CON_FILHIT0_TXPRI0_SIZE                          0x1
#define _B4CON_FILHIT0_TXPRI0_LENGTH                        0x1
#define _B4CON_FILHIT0_TXPRI0_MASK                          0x1
#define _B4CON_FILHIT1_TXPRI1_POSN                          0x1
#define _B4CON_FILHIT1_TXPRI1_POSITION                      0x1
#define _B4CON_FILHIT1_TXPRI1_SIZE                          0x1
#define _B4CON_FILHIT1_TXPRI1_LENGTH                        0x1
#define _B4CON_FILHIT1_TXPRI1_MASK                          0x2
#define _B4CON_FILHIT2_RTREN_POSN                           0x2
#define _B4CON_FILHIT2_RTREN_POSITION                       0x2
#define _B4CON_FILHIT2_RTREN_SIZE                           0x1
#define _B4CON_FILHIT2_RTREN_LENGTH                         0x1
#define _B4CON_FILHIT2_RTREN_MASK                           0x4
#define _B4CON_FILHIT3_TXREQ_POSN                           0x3
#define _B4CON_FILHIT3_TXREQ_POSITION                       0x3
#define _B4CON_FILHIT3_TXREQ_SIZE                           0x1
#define _B4CON_FILHIT3_TXREQ_LENGTH                         0x1
#define _B4CON_FILHIT3_TXREQ_MASK                           0x8
#define _B4CON_FILHIT4_TXERR_POSN                           0x4
#define _B4CON_FILHIT4_TXERR_POSITION                       0x4
#define _B4CON_FILHIT4_TXERR_SIZE                           0x1
#define _B4CON_FILHIT4_TXERR_LENGTH                         0x1
#define _B4CON_FILHIT4_TXERR_MASK                           0x10
#define _B4CON_RXRTRRO_TXLARB_POSN                          0x5
#define _B4CON_RXRTRRO_TXLARB_POSITION                      0x5
#define _B4CON_RXRTRRO_TXLARB_SIZE                          0x1
#define _B4CON_RXRTRRO_TXLARB_LENGTH                        0x1
#define _B4CON_RXRTRRO_TXLARB_MASK                          0x20
#define _B4CON_RXM1_TXABT_POSN                              0x6
#define _B4CON_RXM1_TXABT_POSITION                          0x6
#define _B4CON_RXM1_TXABT_SIZE                              0x1
#define _B4CON_RXM1_TXABT_LENGTH                            0x1
#define _B4CON_RXM1_TXABT_MASK                              0x40
#define _B4CON_RXFUL_TXBIF_POSN                             0x7
#define _B4CON_RXFUL_TXBIF_POSITION                         0x7
#define _B4CON_RXFUL_TXBIF_SIZE                             0x1
#define _B4CON_RXFUL_TXBIF_LENGTH                           0x1
#define _B4CON_RXFUL_TXBIF_MASK                             0x80
#define _B4CON_FILHIT0_POSN                                 0x0
#define _B4CON_FILHIT0_POSITION                             0x0
#define _B4CON_FILHIT0_SIZE                                 0x1
#define _B4CON_FILHIT0_LENGTH                               0x1
#define _B4CON_FILHIT0_MASK                                 0x1
#define _B4CON_FILHIT1_POSN                                 0x1
#define _B4CON_FILHIT1_POSITION                             0x1
#define _B4CON_FILHIT1_SIZE                                 0x1
#define _B4CON_FILHIT1_LENGTH                               0x1
#define _B4CON_FILHIT1_MASK                                 0x2
#define _B4CON_FILHIT2_POSN                                 0x2
#define _B4CON_FILHIT2_POSITION                             0x2
#define _B4CON_FILHIT2_SIZE                                 0x1
#define _B4CON_FILHIT2_LENGTH                               0x1
#define _B4CON_FILHIT2_MASK                                 0x4
#define _B4CON_FILHIT3_POSN                                 0x3
#define _B4CON_FILHIT3_POSITION                             0x3
#define _B4CON_FILHIT3_SIZE                                 0x1
#define _B4CON_FILHIT3_LENGTH                               0x1
#define _B4CON_FILHIT3_MASK                                 0x8
#define _B4CON_FILHIT4_POSN                                 0x4
#define _B4CON_FILHIT4_POSITION                             0x4
#define _B4CON_FILHIT4_SIZE                                 0x1
#define _B4CON_FILHIT4_LENGTH                               0x1
#define _B4CON_FILHIT4_MASK                                 0x10
#define _B4CON_RTRRO_POSN                                   0x5
#define _B4CON_RTRRO_POSITION                               0x5
#define _B4CON_RTRRO_SIZE                                   0x1
#define _B4CON_RTRRO_LENGTH                                 0x1
#define _B4CON_RTRRO_MASK                                   0x20
#define _B4CON_RXM1_POSN                                    0x6
#define _B4CON_RXM1_POSITION                                0x6
#define _B4CON_RXM1_SIZE                                    0x1
#define _B4CON_RXM1_LENGTH                                  0x1
#define _B4CON_RXM1_MASK                                    0x40
#define _B4CON_RXFUL_POSN                                   0x7
#define _B4CON_RXFUL_POSITION                               0x7
#define _B4CON_RXFUL_SIZE                                   0x1
#define _B4CON_RXFUL_LENGTH                                 0x1
#define _B4CON_RXFUL_MASK                                   0x80
#define _B4CON_TXPRI0_POSN                                  0x0
#define _B4CON_TXPRI0_POSITION                              0x0
#define _B4CON_TXPRI0_SIZE                                  0x1
#define _B4CON_TXPRI0_LENGTH                                0x1
#define _B4CON_TXPRI0_MASK                                  0x1
#define _B4CON_TXPRI1_POSN                                  0x1
#define _B4CON_TXPRI1_POSITION                              0x1
#define _B4CON_TXPRI1_SIZE                                  0x1
#define _B4CON_TXPRI1_LENGTH                                0x1
#define _B4CON_TXPRI1_MASK                                  0x2
#define _B4CON_RTREN_POSN                                   0x2
#define _B4CON_RTREN_POSITION                               0x2
#define _B4CON_RTREN_SIZE                                   0x1
#define _B4CON_RTREN_LENGTH                                 0x1
#define _B4CON_RTREN_MASK                                   0x4
#define _B4CON_TXREQ_POSN                                   0x3
#define _B4CON_TXREQ_POSITION                               0x3
#define _B4CON_TXREQ_SIZE                                   0x1
#define _B4CON_TXREQ_LENGTH                                 0x1
#define _B4CON_TXREQ_MASK                                   0x8
#define _B4CON_TXERR_POSN                                   0x4
#define _B4CON_TXERR_POSITION                               0x4
#define _B4CON_TXERR_SIZE                                   0x1
#define _B4CON_TXERR_LENGTH                                 0x1
#define _B4CON_TXERR_MASK                                   0x10
#define _B4CON_TXLARB_POSN                                  0x5
#define _B4CON_TXLARB_POSITION                              0x5
#define _B4CON_TXLARB_SIZE                                  0x1
#define _B4CON_TXLARB_LENGTH                                0x1
#define _B4CON_TXLARB_MASK                                  0x20
#define _B4CON_TXABT_POSN                                   0x6
#define _B4CON_TXABT_POSITION                               0x6
#define _B4CON_TXABT_SIZE                                   0x1
#define _B4CON_TXABT_LENGTH                                 0x1
#define _B4CON_TXABT_MASK                                   0x40
#define _B4CON_TXBIF_POSN                                   0x7
#define _B4CON_TXBIF_POSITION                               0x7
#define _B4CON_TXBIF_SIZE                                   0x1
#define _B4CON_TXBIF_LENGTH                                 0x1
#define _B4CON_TXBIF_MASK                                   0x80
#define _B4CON_RXRTRRO_POSN                                 0x5
#define _B4CON_RXRTRRO_POSITION                             0x5
#define _B4CON_RXRTRRO_SIZE                                 0x1
#define _B4CON_RXRTRRO_LENGTH                               0x1
#define _B4CON_RXRTRRO_MASK                                 0x20
#define _B4CON_B4FILHIT0_POSN                               0x0
#define _B4CON_B4FILHIT0_POSITION                           0x0
#define _B4CON_B4FILHIT0_SIZE                               0x1
#define _B4CON_B4FILHIT0_LENGTH                             0x1
#define _B4CON_B4FILHIT0_MASK                               0x1
#define _B4CON_B4FILHIT1_POSN                               0x1
#define _B4CON_B4FILHIT1_POSITION                           0x1
#define _B4CON_B4FILHIT1_SIZE                               0x1
#define _B4CON_B4FILHIT1_LENGTH                             0x1
#define _B4CON_B4FILHIT1_MASK                               0x2
#define _B4CON_B4FILHIT2_POSN                               0x2
#define _B4CON_B4FILHIT2_POSITION                           0x2
#define _B4CON_B4FILHIT2_SIZE                               0x1
#define _B4CON_B4FILHIT2_LENGTH                             0x1
#define _B4CON_B4FILHIT2_MASK                               0x4
#define _B4CON_B4FILHIT3_POSN                               0x3
#define _B4CON_B4FILHIT3_POSITION                           0x3
#define _B4CON_B4FILHIT3_SIZE                               0x1
#define _B4CON_B4FILHIT3_LENGTH                             0x1
#define _B4CON_B4FILHIT3_MASK                               0x8
#define _B4CON_B4FILHIT4_POSN                               0x4
#define _B4CON_B4FILHIT4_POSITION                           0x4
#define _B4CON_B4FILHIT4_SIZE                               0x1
#define _B4CON_B4FILHIT4_LENGTH                             0x1
#define _B4CON_B4FILHIT4_MASK                               0x10
#define _B4CON_B4RTRRO_POSN                                 0x5
#define _B4CON_B4RTRRO_POSITION                             0x5
#define _B4CON_B4RTRRO_SIZE                                 0x1
#define _B4CON_B4RTRRO_LENGTH                               0x1
#define _B4CON_B4RTRRO_MASK                                 0x20
#define _B4CON_B4RXM1_POSN                                  0x6
#define _B4CON_B4RXM1_POSITION                              0x6
#define _B4CON_B4RXM1_SIZE                                  0x1
#define _B4CON_B4RXM1_LENGTH                                0x1
#define _B4CON_B4RXM1_MASK                                  0x40
#define _B4CON_B4RXFUL_POSN                                 0x7
#define _B4CON_B4RXFUL_POSITION                             0x7
#define _B4CON_B4RXFUL_SIZE                                 0x1
#define _B4CON_B4RXFUL_LENGTH                               0x1
#define _B4CON_B4RXFUL_MASK                                 0x80
#define _B4CON_B4TXPRI0_POSN                                0x0
#define _B4CON_B4TXPRI0_POSITION                            0x0
#define _B4CON_B4TXPRI0_SIZE                                0x1
#define _B4CON_B4TXPRI0_LENGTH                              0x1
#define _B4CON_B4TXPRI0_MASK                                0x1
#define _B4CON_B4TXPRI1_POSN                                0x1
#define _B4CON_B4TXPRI1_POSITION                            0x1
#define _B4CON_B4TXPRI1_SIZE                                0x1
#define _B4CON_B4TXPRI1_LENGTH                              0x1
#define _B4CON_B4TXPRI1_MASK                                0x2
#define _B4CON_B4RTREN_POSN                                 0x2
#define _B4CON_B4RTREN_POSITION                             0x2
#define _B4CON_B4RTREN_SIZE                                 0x1
#define _B4CON_B4RTREN_LENGTH                               0x1
#define _B4CON_B4RTREN_MASK                                 0x4
#define _B4CON_B4TXREQ_POSN                                 0x3
#define _B4CON_B4TXREQ_POSITION                             0x3
#define _B4CON_B4TXREQ_SIZE                                 0x1
#define _B4CON_B4TXREQ_LENGTH                               0x1
#define _B4CON_B4TXREQ_MASK                                 0x8
#define _B4CON_B4TXERR_POSN                                 0x4
#define _B4CON_B4TXERR_POSITION                             0x4
#define _B4CON_B4TXERR_SIZE                                 0x1
#define _B4CON_B4TXERR_LENGTH                               0x1
#define _B4CON_B4TXERR_MASK                                 0x10
#define _B4CON_B4TXLARB_POSN                                0x5
#define _B4CON_B4TXLARB_POSITION                            0x5
#define _B4CON_B4TXLARB_SIZE                                0x1
#define _B4CON_B4TXLARB_LENGTH                              0x1
#define _B4CON_B4TXLARB_MASK                                0x20
#define _B4CON_B4TXABT_POSN                                 0x6
#define _B4CON_B4TXABT_POSITION                             0x6
#define _B4CON_B4TXABT_SIZE                                 0x1
#define _B4CON_B4TXABT_LENGTH                               0x1
#define _B4CON_B4TXABT_MASK                                 0x40
#define _B4CON_B4TXB3IF_POSN                                0x7
#define _B4CON_B4TXB3IF_POSITION                            0x7
#define _B4CON_B4TXB3IF_SIZE                                0x1
#define _B4CON_B4TXB3IF_LENGTH                              0x1
#define _B4CON_B4TXB3IF_MASK                                0x80

// Register: B4SIDH
#define B4SIDH B4SIDH
extern volatile unsigned char           B4SIDH              __at(0xE61);
#ifndef _LIB_BUILD
asm("B4SIDH equ 0E61h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned B4SID3                 :1;
        unsigned B4SID4                 :1;
        unsigned B4SID5                 :1;
        unsigned B4SID6                 :1;
        unsigned B4SID7                 :1;
        unsigned B4SID8                 :1;
        unsigned B4SID9                 :1;
        unsigned B4SID10                :1;
    };
} B4SIDHbits_t;
