MikroElektronika/core_packages/PIC/XC8/def/PIC18F4685/mcu.h
extern volatile B4D6bits_t B4D6bits __at(0xE6C);
// bitfield macros
#define _B4D6_B4D60_POSN                                    0x0
#define _B4D6_B4D60_POSITION                                0x0
#define _B4D6_B4D60_SIZE                                    0x1
#define _B4D6_B4D60_LENGTH                                  0x1
#define _B4D6_B4D60_MASK                                    0x1
#define _B4D6_B4D61_POSN                                    0x1
#define _B4D6_B4D61_POSITION                                0x1
#define _B4D6_B4D61_SIZE                                    0x1
#define _B4D6_B4D61_LENGTH                                  0x1
#define _B4D6_B4D61_MASK                                    0x2
#define _B4D6_B4D62_POSN                                    0x2
#define _B4D6_B4D62_POSITION                                0x2
#define _B4D6_B4D62_SIZE                                    0x1
#define _B4D6_B4D62_LENGTH                                  0x1
#define _B4D6_B4D62_MASK                                    0x4
#define _B4D6_B4D63_POSN                                    0x3
#define _B4D6_B4D63_POSITION                                0x3
#define _B4D6_B4D63_SIZE                                    0x1
#define _B4D6_B4D63_LENGTH                                  0x1
#define _B4D6_B4D63_MASK                                    0x8
#define _B4D6_B4D64_POSN                                    0x4
#define _B4D6_B4D64_POSITION                                0x4
#define _B4D6_B4D64_SIZE                                    0x1
#define _B4D6_B4D64_LENGTH                                  0x1
#define _B4D6_B4D64_MASK                                    0x10
#define _B4D6_B4D65_POSN                                    0x5
#define _B4D6_B4D65_POSITION                                0x5
#define _B4D6_B4D65_SIZE                                    0x1
#define _B4D6_B4D65_LENGTH                                  0x1
#define _B4D6_B4D65_MASK                                    0x20
#define _B4D6_B4D66_POSN                                    0x6
#define _B4D6_B4D66_POSITION                                0x6
#define _B4D6_B4D66_SIZE                                    0x1
#define _B4D6_B4D66_LENGTH                                  0x1
#define _B4D6_B4D66_MASK                                    0x40
#define _B4D6_B4D67_POSN                                    0x7
#define _B4D6_B4D67_POSITION                                0x7
#define _B4D6_B4D67_SIZE                                    0x1
#define _B4D6_B4D67_LENGTH                                  0x1
#define _B4D6_B4D67_MASK                                    0x80

// Register: B4D7
#define B4D7 B4D7
extern volatile unsigned char           B4D7                __at(0xE6D);
#ifndef _LIB_BUILD
asm("B4D7 equ 0E6Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B4D70                  :1;
        unsigned B4D71                  :1;
        unsigned B4D72                  :1;
        unsigned B4D73                  :1;
        unsigned B4D74                  :1;
        unsigned B4D75                  :1;
        unsigned B4D76                  :1;
        unsigned B4D77                  :1;
    };
    struct {
        unsigned                        :7;
        unsigned B46D77                 :1;
    };
} B4D7bits_t;
extern volatile B4D7bits_t B4D7bits __at(0xE6D);
// bitfield macros
#define _B4D7_B4D70_POSN                                    0x0
#define _B4D7_B4D70_POSITION                                0x0
#define _B4D7_B4D70_SIZE                                    0x1
#define _B4D7_B4D70_LENGTH                                  0x1
#define _B4D7_B4D70_MASK                                    0x1
#define _B4D7_B4D71_POSN                                    0x1
#define _B4D7_B4D71_POSITION                                0x1
#define _B4D7_B4D71_SIZE                                    0x1
#define _B4D7_B4D71_LENGTH                                  0x1
#define _B4D7_B4D71_MASK                                    0x2
#define _B4D7_B4D72_POSN                                    0x2
#define _B4D7_B4D72_POSITION                                0x2
#define _B4D7_B4D72_SIZE                                    0x1
#define _B4D7_B4D72_LENGTH                                  0x1
#define _B4D7_B4D72_MASK                                    0x4
#define _B4D7_B4D73_POSN                                    0x3
#define _B4D7_B4D73_POSITION                                0x3
#define _B4D7_B4D73_SIZE                                    0x1
#define _B4D7_B4D73_LENGTH                                  0x1
#define _B4D7_B4D73_MASK                                    0x8
#define _B4D7_B4D74_POSN                                    0x4
#define _B4D7_B4D74_POSITION                                0x4
#define _B4D7_B4D74_SIZE                                    0x1
#define _B4D7_B4D74_LENGTH                                  0x1
#define _B4D7_B4D74_MASK                                    0x10
#define _B4D7_B4D75_POSN                                    0x5
#define _B4D7_B4D75_POSITION                                0x5
#define _B4D7_B4D75_SIZE                                    0x1
#define _B4D7_B4D75_LENGTH                                  0x1
#define _B4D7_B4D75_MASK                                    0x20
#define _B4D7_B4D76_POSN                                    0x6
#define _B4D7_B4D76_POSITION                                0x6
#define _B4D7_B4D76_SIZE                                    0x1
#define _B4D7_B4D76_LENGTH                                  0x1
#define _B4D7_B4D76_MASK                                    0x40
#define _B4D7_B4D77_POSN                                    0x7
#define _B4D7_B4D77_POSITION                                0x7
#define _B4D7_B4D77_SIZE                                    0x1
#define _B4D7_B4D77_LENGTH                                  0x1
#define _B4D7_B4D77_MASK                                    0x80
#define _B4D7_B46D77_POSN                                   0x7
#define _B4D7_B46D77_POSITION                               0x7
#define _B4D7_B46D77_SIZE                                   0x1
#define _B4D7_B46D77_LENGTH                                 0x1
#define _B4D7_B46D77_MASK                                   0x80

// Register: CANSTAT_RO5
#define CANSTAT_RO5 CANSTAT_RO5
extern volatile unsigned char           CANSTAT_RO5         __at(0xE6E);
#ifndef _LIB_BUILD
asm("CANSTAT_RO5 equ 0E6Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EICODE0                :1;
        unsigned EICODE1_ICODE0         :1;
        unsigned EICODE2_ICODE1         :1;
        unsigned EICODE3_ICODE2         :1;
        unsigned EICODE4                :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
    struct {
        unsigned ICODE0                 :1;
        unsigned ICODE1                 :1;
        unsigned ICODE2                 :1;
        unsigned ICODE3                 :1;
        unsigned ICODE4                 :1;
    };
} CANSTAT_RO5bits_t;
