MikroElektronika/core_packages/PIC/XC8/def/PIC18F4685/mcu.h
extern volatile B5CONbits_t B5CONbits __at(0xE70);
// bitfield macros
#define _B5CON_FILHIT0_TXPRI0_POSN                          0x0
#define _B5CON_FILHIT0_TXPRI0_POSITION                      0x0
#define _B5CON_FILHIT0_TXPRI0_SIZE                          0x1
#define _B5CON_FILHIT0_TXPRI0_LENGTH                        0x1
#define _B5CON_FILHIT0_TXPRI0_MASK                          0x1
#define _B5CON_FILHIT1_TXPRI1_POSN                          0x1
#define _B5CON_FILHIT1_TXPRI1_POSITION                      0x1
#define _B5CON_FILHIT1_TXPRI1_SIZE                          0x1
#define _B5CON_FILHIT1_TXPRI1_LENGTH                        0x1
#define _B5CON_FILHIT1_TXPRI1_MASK                          0x2
#define _B5CON_FILHIT2_RTREN_POSN                           0x2
#define _B5CON_FILHIT2_RTREN_POSITION                       0x2
#define _B5CON_FILHIT2_RTREN_SIZE                           0x1
#define _B5CON_FILHIT2_RTREN_LENGTH                         0x1
#define _B5CON_FILHIT2_RTREN_MASK                           0x4
#define _B5CON_FILHIT3_TXREQ_POSN                           0x3
#define _B5CON_FILHIT3_TXREQ_POSITION                       0x3
#define _B5CON_FILHIT3_TXREQ_SIZE                           0x1
#define _B5CON_FILHIT3_TXREQ_LENGTH                         0x1
#define _B5CON_FILHIT3_TXREQ_MASK                           0x8
#define _B5CON_FILHIT4_TXERR_POSN                           0x4
#define _B5CON_FILHIT4_TXERR_POSITION                       0x4
#define _B5CON_FILHIT4_TXERR_SIZE                           0x1
#define _B5CON_FILHIT4_TXERR_LENGTH                         0x1
#define _B5CON_FILHIT4_TXERR_MASK                           0x10
#define _B5CON_RXRTRRO_TXLARB_POSN                          0x5
#define _B5CON_RXRTRRO_TXLARB_POSITION                      0x5
#define _B5CON_RXRTRRO_TXLARB_SIZE                          0x1
#define _B5CON_RXRTRRO_TXLARB_LENGTH                        0x1
#define _B5CON_RXRTRRO_TXLARB_MASK                          0x20
#define _B5CON_RXM1_TXABT_POSN                              0x6
#define _B5CON_RXM1_TXABT_POSITION                          0x6
#define _B5CON_RXM1_TXABT_SIZE                              0x1
#define _B5CON_RXM1_TXABT_LENGTH                            0x1
#define _B5CON_RXM1_TXABT_MASK                              0x40
#define _B5CON_RXFUL_TXBIF_POSN                             0x7
#define _B5CON_RXFUL_TXBIF_POSITION                         0x7
#define _B5CON_RXFUL_TXBIF_SIZE                             0x1
#define _B5CON_RXFUL_TXBIF_LENGTH                           0x1
#define _B5CON_RXFUL_TXBIF_MASK                             0x80
#define _B5CON_FILHIT0_POSN                                 0x0
#define _B5CON_FILHIT0_POSITION                             0x0
#define _B5CON_FILHIT0_SIZE                                 0x1
#define _B5CON_FILHIT0_LENGTH                               0x1
#define _B5CON_FILHIT0_MASK                                 0x1
#define _B5CON_FILHIT1_POSN                                 0x1
#define _B5CON_FILHIT1_POSITION                             0x1
#define _B5CON_FILHIT1_SIZE                                 0x1
#define _B5CON_FILHIT1_LENGTH                               0x1
#define _B5CON_FILHIT1_MASK                                 0x2
#define _B5CON_FILHIT2_POSN                                 0x2
#define _B5CON_FILHIT2_POSITION                             0x2
#define _B5CON_FILHIT2_SIZE                                 0x1
#define _B5CON_FILHIT2_LENGTH                               0x1
#define _B5CON_FILHIT2_MASK                                 0x4
#define _B5CON_FILHIT3_POSN                                 0x3
#define _B5CON_FILHIT3_POSITION                             0x3
#define _B5CON_FILHIT3_SIZE                                 0x1
#define _B5CON_FILHIT3_LENGTH                               0x1
#define _B5CON_FILHIT3_MASK                                 0x8
#define _B5CON_FILHIT4_POSN                                 0x4
#define _B5CON_FILHIT4_POSITION                             0x4
#define _B5CON_FILHIT4_SIZE                                 0x1
#define _B5CON_FILHIT4_LENGTH                               0x1
#define _B5CON_FILHIT4_MASK                                 0x10
#define _B5CON_RTRRO_POSN                                   0x5
#define _B5CON_RTRRO_POSITION                               0x5
#define _B5CON_RTRRO_SIZE                                   0x1
#define _B5CON_RTRRO_LENGTH                                 0x1
#define _B5CON_RTRRO_MASK                                   0x20
#define _B5CON_RXM1_POSN                                    0x6
#define _B5CON_RXM1_POSITION                                0x6
#define _B5CON_RXM1_SIZE                                    0x1
#define _B5CON_RXM1_LENGTH                                  0x1
#define _B5CON_RXM1_MASK                                    0x40
#define _B5CON_RXFUL_POSN                                   0x7
#define _B5CON_RXFUL_POSITION                               0x7
#define _B5CON_RXFUL_SIZE                                   0x1
#define _B5CON_RXFUL_LENGTH                                 0x1
#define _B5CON_RXFUL_MASK                                   0x80
#define _B5CON_TXPRI0_POSN                                  0x0
#define _B5CON_TXPRI0_POSITION                              0x0
#define _B5CON_TXPRI0_SIZE                                  0x1
#define _B5CON_TXPRI0_LENGTH                                0x1
#define _B5CON_TXPRI0_MASK                                  0x1
#define _B5CON_TXPRI1_POSN                                  0x1
#define _B5CON_TXPRI1_POSITION                              0x1
#define _B5CON_TXPRI1_SIZE                                  0x1
#define _B5CON_TXPRI1_LENGTH                                0x1
#define _B5CON_TXPRI1_MASK                                  0x2
#define _B5CON_RTREN_POSN                                   0x2
#define _B5CON_RTREN_POSITION                               0x2
#define _B5CON_RTREN_SIZE                                   0x1
#define _B5CON_RTREN_LENGTH                                 0x1
#define _B5CON_RTREN_MASK                                   0x4
#define _B5CON_TXREQ_POSN                                   0x3
#define _B5CON_TXREQ_POSITION                               0x3
#define _B5CON_TXREQ_SIZE                                   0x1
#define _B5CON_TXREQ_LENGTH                                 0x1
#define _B5CON_TXREQ_MASK                                   0x8
#define _B5CON_TXERR_POSN                                   0x4
#define _B5CON_TXERR_POSITION                               0x4
#define _B5CON_TXERR_SIZE                                   0x1
#define _B5CON_TXERR_LENGTH                                 0x1
#define _B5CON_TXERR_MASK                                   0x10
#define _B5CON_TXLARB_POSN                                  0x5
#define _B5CON_TXLARB_POSITION                              0x5
#define _B5CON_TXLARB_SIZE                                  0x1
#define _B5CON_TXLARB_LENGTH                                0x1
#define _B5CON_TXLARB_MASK                                  0x20
#define _B5CON_TXABT_POSN                                   0x6
#define _B5CON_TXABT_POSITION                               0x6
#define _B5CON_TXABT_SIZE                                   0x1
#define _B5CON_TXABT_LENGTH                                 0x1
#define _B5CON_TXABT_MASK                                   0x40
#define _B5CON_TXBIF_POSN                                   0x7
#define _B5CON_TXBIF_POSITION                               0x7
#define _B5CON_TXBIF_SIZE                                   0x1
#define _B5CON_TXBIF_LENGTH                                 0x1
#define _B5CON_TXBIF_MASK                                   0x80
#define _B5CON_RXRTRRO_POSN                                 0x5
#define _B5CON_RXRTRRO_POSITION                             0x5
#define _B5CON_RXRTRRO_SIZE                                 0x1
#define _B5CON_RXRTRRO_LENGTH                               0x1
#define _B5CON_RXRTRRO_MASK                                 0x20
#define _B5CON_B5FILHIT0_POSN                               0x0
#define _B5CON_B5FILHIT0_POSITION                           0x0
#define _B5CON_B5FILHIT0_SIZE                               0x1
#define _B5CON_B5FILHIT0_LENGTH                             0x1
#define _B5CON_B5FILHIT0_MASK                               0x1
#define _B5CON_B5FILHIT1_POSN                               0x1
#define _B5CON_B5FILHIT1_POSITION                           0x1
#define _B5CON_B5FILHIT1_SIZE                               0x1
#define _B5CON_B5FILHIT1_LENGTH                             0x1
#define _B5CON_B5FILHIT1_MASK                               0x2
#define _B5CON_B5FILHIT2_POSN                               0x2
#define _B5CON_B5FILHIT2_POSITION                           0x2
#define _B5CON_B5FILHIT2_SIZE                               0x1
#define _B5CON_B5FILHIT2_LENGTH                             0x1
#define _B5CON_B5FILHIT2_MASK                               0x4
#define _B5CON_B5FILHIT3_POSN                               0x3
#define _B5CON_B5FILHIT3_POSITION                           0x3
#define _B5CON_B5FILHIT3_SIZE                               0x1
#define _B5CON_B5FILHIT3_LENGTH                             0x1
#define _B5CON_B5FILHIT3_MASK                               0x8
#define _B5CON_B5FILHIT4_POSN                               0x4
#define _B5CON_B5FILHIT4_POSITION                           0x4
#define _B5CON_B5FILHIT4_SIZE                               0x1
#define _B5CON_B5FILHIT4_LENGTH                             0x1
#define _B5CON_B5FILHIT4_MASK                               0x10
#define _B5CON_B5RTRRO_POSN                                 0x5
#define _B5CON_B5RTRRO_POSITION                             0x5
#define _B5CON_B5RTRRO_SIZE                                 0x1
#define _B5CON_B5RTRRO_LENGTH                               0x1
#define _B5CON_B5RTRRO_MASK                                 0x20
#define _B5CON_B5RXM1_POSN                                  0x6
#define _B5CON_B5RXM1_POSITION                              0x6
#define _B5CON_B5RXM1_SIZE                                  0x1
#define _B5CON_B5RXM1_LENGTH                                0x1
#define _B5CON_B5RXM1_MASK                                  0x40
#define _B5CON_B5RXFUL_POSN                                 0x7
#define _B5CON_B5RXFUL_POSITION                             0x7
#define _B5CON_B5RXFUL_SIZE                                 0x1
#define _B5CON_B5RXFUL_LENGTH                               0x1
#define _B5CON_B5RXFUL_MASK                                 0x80
#define _B5CON_B5TXPRI0_POSN                                0x0
#define _B5CON_B5TXPRI0_POSITION                            0x0
#define _B5CON_B5TXPRI0_SIZE                                0x1
#define _B5CON_B5TXPRI0_LENGTH                              0x1
#define _B5CON_B5TXPRI0_MASK                                0x1
#define _B5CON_B5TXPRI1_POSN                                0x1
#define _B5CON_B5TXPRI1_POSITION                            0x1
#define _B5CON_B5TXPRI1_SIZE                                0x1
#define _B5CON_B5TXPRI1_LENGTH                              0x1
#define _B5CON_B5TXPRI1_MASK                                0x2
#define _B5CON_B5RTREN_POSN                                 0x2
#define _B5CON_B5RTREN_POSITION                             0x2
#define _B5CON_B5RTREN_SIZE                                 0x1
#define _B5CON_B5RTREN_LENGTH                               0x1
#define _B5CON_B5RTREN_MASK                                 0x4
#define _B5CON_B5TXREQ_POSN                                 0x3
#define _B5CON_B5TXREQ_POSITION                             0x3
#define _B5CON_B5TXREQ_SIZE                                 0x1
#define _B5CON_B5TXREQ_LENGTH                               0x1
#define _B5CON_B5TXREQ_MASK                                 0x8
#define _B5CON_B5TXERR_POSN                                 0x4
#define _B5CON_B5TXERR_POSITION                             0x4
#define _B5CON_B5TXERR_SIZE                                 0x1
#define _B5CON_B5TXERR_LENGTH                               0x1
#define _B5CON_B5TXERR_MASK                                 0x10
#define _B5CON_B5TXLARB_POSN                                0x5
#define _B5CON_B5TXLARB_POSITION                            0x5
#define _B5CON_B5TXLARB_SIZE                                0x1
#define _B5CON_B5TXLARB_LENGTH                              0x1
#define _B5CON_B5TXLARB_MASK                                0x20
#define _B5CON_B5TXABT_POSN                                 0x6
#define _B5CON_B5TXABT_POSITION                             0x6
#define _B5CON_B5TXABT_SIZE                                 0x1
#define _B5CON_B5TXABT_LENGTH                               0x1
#define _B5CON_B5TXABT_MASK                                 0x40
#define _B5CON_B5TXBIF_POSN                                 0x7
#define _B5CON_B5TXBIF_POSITION                             0x7
#define _B5CON_B5TXBIF_SIZE                                 0x1
#define _B5CON_B5TXBIF_LENGTH                               0x1
#define _B5CON_B5TXBIF_MASK                                 0x80

// Register: B5SIDH
#define B5SIDH B5SIDH
extern volatile unsigned char           B5SIDH              __at(0xE71);
#ifndef _LIB_BUILD
asm("B5SIDH equ 0E71h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned B5SID3                 :1;
        unsigned B5SID4                 :1;
        unsigned B5SID5                 :1;
        unsigned B5SID6                 :1;
        unsigned B5SID7                 :1;
        unsigned B5SID8                 :1;
        unsigned B5SID9                 :1;
        unsigned B5SID10                :1;
    };
} B5SIDHbits_t;
extern volatile B5SIDHbits_t B5SIDHbits __at(0xE71);
// bitfield macros
#define _B5SIDH_SID3_POSN                                   0x0
#define _B5SIDH_SID3_POSITION                               0x0
#define _B5SIDH_SID3_SIZE                                   0x1
#define _B5SIDH_SID3_LENGTH                                 0x1
#define _B5SIDH_SID3_MASK                                   0x1
#define _B5SIDH_SID4_POSN                                   0x1
#define _B5SIDH_SID4_POSITION                               0x1
#define _B5SIDH_SID4_SIZE                                   0x1
#define _B5SIDH_SID4_LENGTH                                 0x1
#define _B5SIDH_SID4_MASK                                   0x2
#define _B5SIDH_SID5_POSN                                   0x2
#define _B5SIDH_SID5_POSITION                               0x2
#define _B5SIDH_SID5_SIZE                                   0x1
#define _B5SIDH_SID5_LENGTH                                 0x1
#define _B5SIDH_SID5_MASK                                   0x4
#define _B5SIDH_SID6_POSN                                   0x3
#define _B5SIDH_SID6_POSITION                               0x3
#define _B5SIDH_SID6_SIZE                                   0x1
#define _B5SIDH_SID6_LENGTH                                 0x1
#define _B5SIDH_SID6_MASK                                   0x8
#define _B5SIDH_SID7_POSN                                   0x4
#define _B5SIDH_SID7_POSITION                               0x4
#define _B5SIDH_SID7_SIZE                                   0x1
#define _B5SIDH_SID7_LENGTH                                 0x1
#define _B5SIDH_SID7_MASK                                   0x10
#define _B5SIDH_SID8_POSN                                   0x5
#define _B5SIDH_SID8_POSITION                               0x5
#define _B5SIDH_SID8_SIZE                                   0x1
#define _B5SIDH_SID8_LENGTH                                 0x1
#define _B5SIDH_SID8_MASK                                   0x20
#define _B5SIDH_SID9_POSN                                   0x6
#define _B5SIDH_SID9_POSITION                               0x6
#define _B5SIDH_SID9_SIZE                                   0x1
#define _B5SIDH_SID9_LENGTH                                 0x1
#define _B5SIDH_SID9_MASK                                   0x40
#define _B5SIDH_SID10_POSN                                  0x7
#define _B5SIDH_SID10_POSITION                              0x7
#define _B5SIDH_SID10_SIZE                                  0x1
#define _B5SIDH_SID10_LENGTH                                0x1
#define _B5SIDH_SID10_MASK                                  0x80
#define _B5SIDH_B5SID3_POSN                                 0x0
#define _B5SIDH_B5SID3_POSITION                             0x0
#define _B5SIDH_B5SID3_SIZE                                 0x1
#define _B5SIDH_B5SID3_LENGTH                               0x1
#define _B5SIDH_B5SID3_MASK                                 0x1
#define _B5SIDH_B5SID4_POSN                                 0x1
#define _B5SIDH_B5SID4_POSITION                             0x1
#define _B5SIDH_B5SID4_SIZE                                 0x1
#define _B5SIDH_B5SID4_LENGTH                               0x1
#define _B5SIDH_B5SID4_MASK                                 0x2
#define _B5SIDH_B5SID5_POSN                                 0x2
#define _B5SIDH_B5SID5_POSITION                             0x2
#define _B5SIDH_B5SID5_SIZE                                 0x1
#define _B5SIDH_B5SID5_LENGTH                               0x1
#define _B5SIDH_B5SID5_MASK                                 0x4
#define _B5SIDH_B5SID6_POSN                                 0x3
#define _B5SIDH_B5SID6_POSITION                             0x3
#define _B5SIDH_B5SID6_SIZE                                 0x1
#define _B5SIDH_B5SID6_LENGTH                               0x1
#define _B5SIDH_B5SID6_MASK                                 0x8
#define _B5SIDH_B5SID7_POSN                                 0x4
#define _B5SIDH_B5SID7_POSITION                             0x4
#define _B5SIDH_B5SID7_SIZE                                 0x1
#define _B5SIDH_B5SID7_LENGTH                               0x1
#define _B5SIDH_B5SID7_MASK                                 0x10
#define _B5SIDH_B5SID8_POSN                                 0x5
#define _B5SIDH_B5SID8_POSITION                             0x5
#define _B5SIDH_B5SID8_SIZE                                 0x1
#define _B5SIDH_B5SID8_LENGTH                               0x1
#define _B5SIDH_B5SID8_MASK                                 0x20
#define _B5SIDH_B5SID9_POSN                                 0x6
#define _B5SIDH_B5SID9_POSITION                             0x6
#define _B5SIDH_B5SID9_SIZE                                 0x1
#define _B5SIDH_B5SID9_LENGTH                               0x1
#define _B5SIDH_B5SID9_MASK                                 0x40
#define _B5SIDH_B5SID10_POSN                                0x7
#define _B5SIDH_B5SID10_POSITION                            0x7
#define _B5SIDH_B5SID10_SIZE                                0x1
#define _B5SIDH_B5SID10_LENGTH                              0x1
#define _B5SIDH_B5SID10_MASK                                0x80

