MikroElektronika/core_packages/PIC/XC8/def/PIC18F4685/mcu.h
extern volatile __bit _DEPRECATED       RA1                 __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit _DEPRECATED       RA2                 __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit _DEPRECATED       RA3                 __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit _DEPRECATED       RA4                 __at(0x7C04);	// @ (0xF80 * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// PORTA<RA5>
extern volatile __bit _DEPRECATED       RA5                 __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit _DEPRECATED       RA6                 __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTA<RA7>
extern volatile __bit _DEPRECATED       RA7                 __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// PORTB<RB0>
extern volatile __bit _DEPRECATED       RB0                 __at(0x7C08);	// @ (0xF81 * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RB1>
extern volatile __bit _DEPRECATED       RB1                 __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RB2>
extern volatile __bit _DEPRECATED       RB2                 __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RB3>
extern volatile __bit _DEPRECATED       RB3                 __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 RB3_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RB4>
extern volatile __bit _DEPRECATED       RB4                 __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit _DEPRECATED       RB5                 __at(0x7C0D);	// @ (0xF81 * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RB6>
extern volatile __bit _DEPRECATED       RB6                 __at(0x7C0E);	// @ (0xF81 * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// PORTB<RB7>
extern volatile __bit _DEPRECATED       RB7                 __at(0x7C0F);	// @ (0xF81 * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// INTCON<RBIE>
extern volatile __bit                   RBIE                __at(0x7F93);	// @ (0xFF2 * 8 + 3)
#define                                 RBIE_bit            _BIT_ACCESS(INTCON,3)
// INTCON<RBIF>
extern volatile __bit                   RBIF                __at(0x7F90);	// @ (0xFF2 * 8 + 0)
#define                                 RBIF_bit            _BIT_ACCESS(INTCON,0)
// INTCON2<RBIP>
extern volatile __bit                   RBIP                __at(0x7F88);	// @ (0xFF1 * 8 + 0)
#define                                 RBIP_bit            _BIT_ACCESS(INTCON2,0)
// INTCON2<RBPU>
extern volatile __bit                   RBPU                __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 RBPU_bit            _BIT_ACCESS(INTCON2,7)
// PORTC<RC0>
extern volatile __bit _DEPRECATED       RC0                 __at(0x7C10);	// @ (0xF82 * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit _DEPRECATED       RC1                 __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PIE1<RC1IE>
extern volatile __bit                   RC1IE               __at(0x7CED);	// @ (0xF9D * 8 + 5)
#define                                 RC1IE_bit           _BIT_ACCESS(PIE1,5)
// PIR1<RC1IF>
extern volatile __bit                   RC1IF               __at(0x7CF5);	// @ (0xF9E * 8 + 5)
#define                                 RC1IF_bit           _BIT_ACCESS(PIR1,5)
// IPR1<RC1IP>
extern volatile __bit                   RC1IP               __at(0x7CFD);	// @ (0xF9F * 8 + 5)
#define                                 RC1IP_bit           _BIT_ACCESS(IPR1,5)
// PORTC<RC2>
extern volatile __bit _DEPRECATED       RC2                 __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PORTC<RC3>
extern volatile __bit _DEPRECATED       RC3                 __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit _DEPRECATED       RC4                 __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit _DEPRECATED       RC5                 __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// PORTC<RC6>
extern volatile __bit _DEPRECATED       RC6                 __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// PORTC<RC7>
extern volatile __bit _DEPRECATED       RC7                 __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// RCSTA<RC8_9>
extern volatile __bit                   RC8_9               __at(0x7D5E);	// @ (0xFAB * 8 + 6)
#define                                 RC8_9_bit           _BIT_ACCESS(RCSTA,6)
// RCSTA<RC9>
extern volatile __bit                   RC9                 __at(0x7D5E);	// @ (0xFAB * 8 + 6)
#define                                 RC9_bit             _BIT_ACCESS(RCSTA,6)
// RCSTA<RCD8>
extern volatile __bit                   RCD8                __at(0x7D58);	// @ (0xFAB * 8 + 0)
#define                                 RCD8_bit            _BIT_ACCESS(RCSTA,0)
// SSPCON2<RCEN>
extern volatile __bit                   RCEN                __at(0x7E2B);	// @ (0xFC5 * 8 + 3)
#define                                 RCEN_bit            _BIT_ACCESS(SSPCON2,3)
// BAUDCON<RCIDL>
extern volatile __bit                   RCIDL               __at(0x7DC6);	// @ (0xFB8 * 8 + 6)
#define                                 RCIDL_bit           _BIT_ACCESS(BAUDCON,6)
// PIE1<RCIE>
extern volatile __bit                   RCIE                __at(0x7CED);	// @ (0xF9D * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<RCIF>
extern volatile __bit                   RCIF                __at(0x7CF5);	// @ (0xF9E * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR1,5)
// IPR1<RCIP>
extern volatile __bit                   RCIP                __at(0x7CFD);	// @ (0xF9F * 8 + 5)
#define                                 RCIP_bit            _BIT_ACCESS(IPR1,5)
// EECON1<RD>
extern volatile __bit _DEPRECATED       RD                  __at(0x7D30);	// @ (0xFA6 * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(EECON1,0)
// PORTD<RD0>
extern volatile __bit _DEPRECATED       RD0                 __at(0x7C18);	// @ (0xF83 * 8 + 0)
#define                                 RD0_bit             _BIT_ACCESS(PORTD,0)
// PORTD<RD1>
extern volatile __bit _DEPRECATED       RD1                 __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 RD1_bit             _BIT_ACCESS(PORTD,1)
// T3CON<RD163>
extern volatile __bit                   RD163               __at(0x7D8F);	// @ (0xFB1 * 8 + 7)
#define                                 RD163_bit           _BIT_ACCESS(T3CON,7)
// PORTD<RD2>
extern volatile __bit _DEPRECATED       RD2                 __at(0x7C1A);	// @ (0xF83 * 8 + 2)
#define                                 RD2_bit             _BIT_ACCESS(PORTD,2)
// PORTD<RD3>
extern volatile __bit _DEPRECATED       RD3                 __at(0x7C1B);	// @ (0xF83 * 8 + 3)
#define                                 RD3_bit             _BIT_ACCESS(PORTD,3)
// PORTD<RD4>
extern volatile __bit _DEPRECATED       RD4                 __at(0x7C1C);	// @ (0xF83 * 8 + 4)
#define                                 RD4_bit             _BIT_ACCESS(PORTD,4)
// PORTD<RD5>
extern volatile __bit _DEPRECATED       RD5                 __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 RD5_bit             _BIT_ACCESS(PORTD,5)
// PORTD<RD6>
extern volatile __bit _DEPRECATED       RD6                 __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 RD6_bit             _BIT_ACCESS(PORTD,6)
// PORTD<RD7>
extern volatile __bit _DEPRECATED       RD7                 __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 RD7_bit             _BIT_ACCESS(PORTD,7)
// PORTE<RDE>
extern volatile __bit                   RDE                 __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 RDE_bit             _BIT_ACCESS(PORTE,0)
// PORTE<RE0>
extern volatile __bit _DEPRECATED       RE0                 __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 RE0_bit             _BIT_ACCESS(PORTE,0)
// PORTE<RE1>
extern volatile __bit _DEPRECATED       RE1                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 RE1_bit             _BIT_ACCESS(PORTE,1)
// PORTE<RE2>
extern volatile __bit _DEPRECATED       RE2                 __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 RE2_bit             _BIT_ACCESS(PORTE,2)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// SSPSTAT<READ_WRITE>
extern volatile __bit                   READ_WRITE          __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 READ_WRITE_bit      _BIT_ACCESS(SSPSTAT,2)
// RXERRCNT<REC0>
extern volatile __bit                   REC0                __at(0x7BA8);	// @ (0xF75 * 8 + 0)
#define                                 REC0_bit            _BIT_ACCESS(RXERRCNT,0)
// RXERRCNT<REC1>
extern volatile __bit                   REC1                __at(0x7BA9);	// @ (0xF75 * 8 + 1)
#define                                 REC1_bit            _BIT_ACCESS(RXERRCNT,1)
// RXERRCNT<REC2>
extern volatile __bit                   REC2                __at(0x7BAA);	// @ (0xF75 * 8 + 2)
#define                                 REC2_bit            _BIT_ACCESS(RXERRCNT,2)
// RXERRCNT<REC3>
extern volatile __bit                   REC3                __at(0x7BAB);	// @ (0xF75 * 8 + 3)
#define                                 REC3_bit            _BIT_ACCESS(RXERRCNT,3)
// RXERRCNT<REC4>
extern volatile __bit                   REC4                __at(0x7BAC);	// @ (0xF75 * 8 + 4)
#define                                 REC4_bit            _BIT_ACCESS(RXERRCNT,4)
// RXERRCNT<REC5>
extern volatile __bit                   REC5                __at(0x7BAD);	// @ (0xF75 * 8 + 5)
#define                                 REC5_bit            _BIT_ACCESS(RXERRCNT,5)
// RXERRCNT<REC6>
extern volatile __bit                   REC6                __at(0x7BAE);	// @ (0xF75 * 8 + 6)
#define                                 REC6_bit            _BIT_ACCESS(RXERRCNT,6)
// RXERRCNT<REC7>
extern volatile __bit                   REC7                __at(0x7BAF);	// @ (0xF75 * 8 + 7)
#define                                 REC7_bit            _BIT_ACCESS(RXERRCNT,7)
// RCON<RI>
extern volatile __bit                   RI                  __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 RI_bit              _BIT_ACCESS(RCON,4)
// PORTA<RJPU>
extern volatile __bit                   RJPU                __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 RJPU_bit            _BIT_ACCESS(PORTA,7)
// SSPCON2<RSEN>
extern volatile __bit                   RSEN                __at(0x7E29);	// @ (0xFC5 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSPCON2,1)
// SSPSTAT<RW>
extern volatile __bit                   RW                  __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 RW_bit              _BIT_ACCESS(SSPSTAT,2)
// PORTC<RX>
extern volatile __bit                   RX                  __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 RX_bit              _BIT_ACCESS(PORTC,7)
// RCSTA<RX9>
extern volatile __bit                   RX9                 __at(0x7D5E);	// @ (0xFAB * 8 + 6)
#define                                 RX9_bit             _BIT_ACCESS(RCSTA,6)
// RCSTA<RX9D>
extern volatile __bit                   RX9D                __at(0x7D58);	// @ (0xFAB * 8 + 0)
#define                                 RX9D_bit            _BIT_ACCESS(RCSTA,0)
// RXB0D0<RXB0D00>
extern volatile __bit                   RXB0D00             __at(0x7B30);	// @ (0xF66 * 8 + 0)
#define                                 RXB0D00_bit         _BIT_ACCESS(RXB0D0,0)
// RXB0D0<RXB0D01>
extern volatile __bit                   RXB0D01             __at(0x7B31);	// @ (0xF66 * 8 + 1)
#define                                 RXB0D01_bit         _BIT_ACCESS(RXB0D0,1)
// RXB0D0<RXB0D02>
extern volatile __bit                   RXB0D02             __at(0x7B32);	// @ (0xF66 * 8 + 2)
#define                                 RXB0D02_bit         _BIT_ACCESS(RXB0D0,2)
// RXB0D0<RXB0D03>
extern volatile __bit                   RXB0D03             __at(0x7B33);	// @ (0xF66 * 8 + 3)
#define                                 RXB0D03_bit         _BIT_ACCESS(RXB0D0,3)
// RXB0D0<RXB0D04>
extern volatile __bit                   RXB0D04             __at(0x7B34);	// @ (0xF66 * 8 + 4)
#define                                 RXB0D04_bit         _BIT_ACCESS(RXB0D0,4)
// RXB0D0<RXB0D05>
extern volatile __bit                   RXB0D05             __at(0x7B35);	// @ (0xF66 * 8 + 5)
#define                                 RXB0D05_bit         _BIT_ACCESS(RXB0D0,5)
// RXB0D0<RXB0D06>
extern volatile __bit                   RXB0D06             __at(0x7B36);	// @ (0xF66 * 8 + 6)
#define                                 RXB0D06_bit         _BIT_ACCESS(RXB0D0,6)
// RXB0D0<RXB0D07>
extern volatile __bit                   RXB0D07             __at(0x7B37);	// @ (0xF66 * 8 + 7)
#define                                 RXB0D07_bit         _BIT_ACCESS(RXB0D0,7)
// RXB0D1<RXB0D10>
extern volatile __bit                   RXB0D10             __at(0x7B38);	// @ (0xF67 * 8 + 0)
#define                                 RXB0D10_bit         _BIT_ACCESS(RXB0D1,0)
// RXB0D1<RXB0D11>
extern volatile __bit                   RXB0D11             __at(0x7B39);	// @ (0xF67 * 8 + 1)
#define                                 RXB0D11_bit         _BIT_ACCESS(RXB0D1,1)
// RXB0D1<RXB0D12>
extern volatile __bit                   RXB0D12             __at(0x7B3A);	// @ (0xF67 * 8 + 2)
#define                                 RXB0D12_bit         _BIT_ACCESS(RXB0D1,2)
// RXB0D1<RXB0D13>
extern volatile __bit                   RXB0D13             __at(0x7B3B);	// @ (0xF67 * 8 + 3)
#define                                 RXB0D13_bit         _BIT_ACCESS(RXB0D1,3)
// RXB0D1<RXB0D14>
extern volatile __bit                   RXB0D14             __at(0x7B3C);	// @ (0xF67 * 8 + 4)
#define                                 RXB0D14_bit         _BIT_ACCESS(RXB0D1,4)
// RXB0D1<RXB0D15>
extern volatile __bit                   RXB0D15             __at(0x7B3D);	// @ (0xF67 * 8 + 5)
#define                                 RXB0D15_bit         _BIT_ACCESS(RXB0D1,5)
// RXB0D1<RXB0D16>
extern volatile __bit                   RXB0D16             __at(0x7B3E);	// @ (0xF67 * 8 + 6)
#define                                 RXB0D16_bit         _BIT_ACCESS(RXB0D1,6)
// RXB0D1<RXB0D17>
extern volatile __bit                   RXB0D17             __at(0x7B3F);	// @ (0xF67 * 8 + 7)
#define                                 RXB0D17_bit         _BIT_ACCESS(RXB0D1,7)
// RXB0D2<RXB0D20>
extern volatile __bit                   RXB0D20             __at(0x7B40);	// @ (0xF68 * 8 + 0)
#define                                 RXB0D20_bit         _BIT_ACCESS(RXB0D2,0)
// RXB0D2<RXB0D21>
extern volatile __bit                   RXB0D21             __at(0x7B41);	// @ (0xF68 * 8 + 1)
#define                                 RXB0D21_bit         _BIT_ACCESS(RXB0D2,1)
// RXB0D2<RXB0D22>
extern volatile __bit                   RXB0D22             __at(0x7B42);	// @ (0xF68 * 8 + 2)
#define                                 RXB0D22_bit         _BIT_ACCESS(RXB0D2,2)
// RXB0D2<RXB0D23>
extern volatile __bit                   RXB0D23             __at(0x7B43);	// @ (0xF68 * 8 + 3)
#define                                 RXB0D23_bit         _BIT_ACCESS(RXB0D2,3)
// RXB0D2<RXB0D24>
extern volatile __bit                   RXB0D24             __at(0x7B44);	// @ (0xF68 * 8 + 4)
#define                                 RXB0D24_bit         _BIT_ACCESS(RXB0D2,4)
// RXB0D2<RXB0D25>
extern volatile __bit                   RXB0D25             __at(0x7B45);	// @ (0xF68 * 8 + 5)
#define                                 RXB0D25_bit         _BIT_ACCESS(RXB0D2,5)
// RXB0D2<RXB0D26>
extern volatile __bit                   RXB0D26             __at(0x7B46);	// @ (0xF68 * 8 + 6)
#define                                 RXB0D26_bit         _BIT_ACCESS(RXB0D2,6)
// RXB0D2<RXB0D27>
extern volatile __bit                   RXB0D27             __at(0x7B47);	// @ (0xF68 * 8 + 7)
#define                                 RXB0D27_bit         _BIT_ACCESS(RXB0D2,7)
// RXB0D3<RXB0D30>
extern volatile __bit                   RXB0D30             __at(0x7B48);	// @ (0xF69 * 8 + 0)
#define                                 RXB0D30_bit         _BIT_ACCESS(RXB0D3,0)
// RXB0D3<RXB0D31>
extern volatile __bit                   RXB0D31             __at(0x7B49);	// @ (0xF69 * 8 + 1)
#define                                 RXB0D31_bit         _BIT_ACCESS(RXB0D3,1)
// RXB0D3<RXB0D32>
extern volatile __bit                   RXB0D32             __at(0x7B4A);	// @ (0xF69 * 8 + 2)
#define                                 RXB0D32_bit         _BIT_ACCESS(RXB0D3,2)
// RXB0D3<RXB0D33>
extern volatile __bit                   RXB0D33             __at(0x7B4B);	// @ (0xF69 * 8 + 3)
#define                                 RXB0D33_bit         _BIT_ACCESS(RXB0D3,3)
// RXB0D3<RXB0D34>
extern volatile __bit                   RXB0D34             __at(0x7B4C);	// @ (0xF69 * 8 + 4)
#define                                 RXB0D34_bit         _BIT_ACCESS(RXB0D3,4)
// RXB0D3<RXB0D35>
extern volatile __bit                   RXB0D35             __at(0x7B4D);	// @ (0xF69 * 8 + 5)
#define                                 RXB0D35_bit         _BIT_ACCESS(RXB0D3,5)
// RXB0D3<RXB0D36>
extern volatile __bit                   RXB0D36             __at(0x7B4E);	// @ (0xF69 * 8 + 6)
#define                                 RXB0D36_bit         _BIT_ACCESS(RXB0D3,6)
// RXB0D3<RXB0D37>
extern volatile __bit                   RXB0D37             __at(0x7B4F);	// @ (0xF69 * 8 + 7)
#define                                 RXB0D37_bit         _BIT_ACCESS(RXB0D3,7)
// RXB0D4<RXB0D40>
extern volatile __bit                   RXB0D40             __at(0x7B50);	// @ (0xF6A * 8 + 0)
#define                                 RXB0D40_bit         _BIT_ACCESS(RXB0D4,0)
// RXB0D4<RXB0D41>
extern volatile __bit                   RXB0D41             __at(0x7B51);	// @ (0xF6A * 8 + 1)
#define                                 RXB0D41_bit         _BIT_ACCESS(RXB0D4,1)
// RXB0D4<RXB0D42>
extern volatile __bit                   RXB0D42             __at(0x7B52);	// @ (0xF6A * 8 + 2)
#define                                 RXB0D42_bit         _BIT_ACCESS(RXB0D4,2)
// RXB0D4<RXB0D43>
extern volatile __bit                   RXB0D43             __at(0x7B53);	// @ (0xF6A * 8 + 3)
#define                                 RXB0D43_bit         _BIT_ACCESS(RXB0D4,3)
// RXB0D4<RXB0D44>
extern volatile __bit                   RXB0D44             __at(0x7B54);	// @ (0xF6A * 8 + 4)
#define                                 RXB0D44_bit         _BIT_ACCESS(RXB0D4,4)
// RXB0D4<RXB0D45>
extern volatile __bit                   RXB0D45             __at(0x7B55);	// @ (0xF6A * 8 + 5)
#define                                 RXB0D45_bit         _BIT_ACCESS(RXB0D4,5)
// RXB0D4<RXB0D46>
extern volatile __bit                   RXB0D46             __at(0x7B56);	// @ (0xF6A * 8 + 6)
#define                                 RXB0D46_bit         _BIT_ACCESS(RXB0D4,6)
// RXB0D4<RXB0D47>
extern volatile __bit                   RXB0D47             __at(0x7B57);	// @ (0xF6A * 8 + 7)
#define                                 RXB0D47_bit         _BIT_ACCESS(RXB0D4,7)
// RXB0D5<RXB0D50>
extern volatile __bit                   RXB0D50             __at(0x7B58);	// @ (0xF6B * 8 + 0)
#define                                 RXB0D50_bit         _BIT_ACCESS(RXB0D5,0)
// RXB0D5<RXB0D51>
extern volatile __bit                   RXB0D51             __at(0x7B59);	// @ (0xF6B * 8 + 1)
#define                                 RXB0D51_bit         _BIT_ACCESS(RXB0D5,1)
// RXB0D5<RXB0D52>
extern volatile __bit                   RXB0D52             __at(0x7B5A);	// @ (0xF6B * 8 + 2)
#define                                 RXB0D52_bit         _BIT_ACCESS(RXB0D5,2)
// RXB0D5<RXB0D53>
extern volatile __bit                   RXB0D53             __at(0x7B5B);	// @ (0xF6B * 8 + 3)
#define                                 RXB0D53_bit         _BIT_ACCESS(RXB0D5,3)
// RXB0D5<RXB0D54>
extern volatile __bit                   RXB0D54             __at(0x7B5C);	// @ (0xF6B * 8 + 4)
#define                                 RXB0D54_bit         _BIT_ACCESS(RXB0D5,4)
// RXB0D5<RXB0D55>
extern volatile __bit                   RXB0D55             __at(0x7B5D);	// @ (0xF6B * 8 + 5)
#define                                 RXB0D55_bit         _BIT_ACCESS(RXB0D5,5)
// RXB0D5<RXB0D56>
extern volatile __bit                   RXB0D56             __at(0x7B5E);	// @ (0xF6B * 8 + 6)
#define                                 RXB0D56_bit         _BIT_ACCESS(RXB0D5,6)
// RXB0D5<RXB0D57>
extern volatile __bit                   RXB0D57             __at(0x7B5F);	// @ (0xF6B * 8 + 7)
#define                                 RXB0D57_bit         _BIT_ACCESS(RXB0D5,7)
// RXB0D6<RXB0D60>
extern volatile __bit                   RXB0D60             __at(0x7B60);	// @ (0xF6C * 8 + 0)
#define                                 RXB0D60_bit         _BIT_ACCESS(RXB0D6,0)
// RXB0D6<RXB0D61>
extern volatile __bit                   RXB0D61             __at(0x7B61);	// @ (0xF6C * 8 + 1)
#define                                 RXB0D61_bit         _BIT_ACCESS(RXB0D6,1)
// RXB0D6<RXB0D62>
extern volatile __bit                   RXB0D62             __at(0x7B62);	// @ (0xF6C * 8 + 2)
#define                                 RXB0D62_bit         _BIT_ACCESS(RXB0D6,2)
// RXB0D6<RXB0D63>
extern volatile __bit                   RXB0D63             __at(0x7B63);	// @ (0xF6C * 8 + 3)
#define                                 RXB0D63_bit         _BIT_ACCESS(RXB0D6,3)
// RXB0D6<RXB0D64>
extern volatile __bit                   RXB0D64             __at(0x7B64);	// @ (0xF6C * 8 + 4)
#define                                 RXB0D64_bit         _BIT_ACCESS(RXB0D6,4)
// RXB0D6<RXB0D65>
extern volatile __bit                   RXB0D65             __at(0x7B65);	// @ (0xF6C * 8 + 5)
#define                                 RXB0D65_bit         _BIT_ACCESS(RXB0D6,5)
// RXB0D6<RXB0D66>
extern volatile __bit                   RXB0D66             __at(0x7B66);	// @ (0xF6C * 8 + 6)
#define                                 RXB0D66_bit         _BIT_ACCESS(RXB0D6,6)
// RXB0D6<RXB0D67>
