MikroElektronika/core_packages/PIC/XC8/def/PIC18F4685/mcu.h
#define                                 RXF10EN_bit         _BIT_ACCESS(RXFCON1,2)
// RXF10SIDL<RXF10EXIDEN>
extern volatile __bit                   RXF10EXIDEN         __at(0x6BAB);	// @ (0xD75 * 8 + 3)
#define                                 RXF10EXIDEN_bit     _BIT_ACCESS(RXF10SIDL,3)
// RXF10SIDL<RXF10SID0>
extern volatile __bit                   RXF10SID0           __at(0x6BAD);	// @ (0xD75 * 8 + 5)
#define                                 RXF10SID0_bit       _BIT_ACCESS(RXF10SIDL,5)
// RXF10SIDL<RXF10SID1>
extern volatile __bit                   RXF10SID1           __at(0x6BAE);	// @ (0xD75 * 8 + 6)
#define                                 RXF10SID1_bit       _BIT_ACCESS(RXF10SIDL,6)
// RXF10SIDH<RXF10SID10>
extern volatile __bit                   RXF10SID10          __at(0x6BA7);	// @ (0xD74 * 8 + 7)
#define                                 RXF10SID10_bit      _BIT_ACCESS(RXF10SIDH,7)
// RXF10SIDL<RXF10SID2>
extern volatile __bit                   RXF10SID2           __at(0x6BAF);	// @ (0xD75 * 8 + 7)
#define                                 RXF10SID2_bit       _BIT_ACCESS(RXF10SIDL,7)
// RXF10SIDH<RXF10SID3>
extern volatile __bit                   RXF10SID3           __at(0x6BA0);	// @ (0xD74 * 8 + 0)
#define                                 RXF10SID3_bit       _BIT_ACCESS(RXF10SIDH,0)
// RXF10SIDH<RXF10SID4>
extern volatile __bit                   RXF10SID4           __at(0x6BA1);	// @ (0xD74 * 8 + 1)
#define                                 RXF10SID4_bit       _BIT_ACCESS(RXF10SIDH,1)
// RXF10SIDH<RXF10SID5>
extern volatile __bit                   RXF10SID5           __at(0x6BA2);	// @ (0xD74 * 8 + 2)
#define                                 RXF10SID5_bit       _BIT_ACCESS(RXF10SIDH,2)
// RXF10SIDH<RXF10SID6>
extern volatile __bit                   RXF10SID6           __at(0x6BA3);	// @ (0xD74 * 8 + 3)
#define                                 RXF10SID6_bit       _BIT_ACCESS(RXF10SIDH,3)
// RXF10SIDH<RXF10SID7>
extern volatile __bit                   RXF10SID7           __at(0x6BA4);	// @ (0xD74 * 8 + 4)
#define                                 RXF10SID7_bit       _BIT_ACCESS(RXF10SIDH,4)
// RXF10SIDH<RXF10SID8>
extern volatile __bit                   RXF10SID8           __at(0x6BA5);	// @ (0xD74 * 8 + 5)
#define                                 RXF10SID8_bit       _BIT_ACCESS(RXF10SIDH,5)
// RXF10SIDH<RXF10SID9>
extern volatile __bit                   RXF10SID9           __at(0x6BA6);	// @ (0xD74 * 8 + 6)
#define                                 RXF10SID9_bit       _BIT_ACCESS(RXF10SIDH,6)
// RXF11EIDL<RXF11EID0>
extern volatile __bit                   RXF11EID0           __at(0x6BD8);	// @ (0xD7B * 8 + 0)
#define                                 RXF11EID0_bit       _BIT_ACCESS(RXF11EIDL,0)
// RXF11EIDL<RXF11EID1>
extern volatile __bit                   RXF11EID1           __at(0x6BD9);	// @ (0xD7B * 8 + 1)
#define                                 RXF11EID1_bit       _BIT_ACCESS(RXF11EIDL,1)
// RXF11EIDH<RXF11EID10>
extern volatile __bit                   RXF11EID10          __at(0x6BD2);	// @ (0xD7A * 8 + 2)
#define                                 RXF11EID10_bit      _BIT_ACCESS(RXF11EIDH,2)
// RXF11EIDH<RXF11EID11>
extern volatile __bit                   RXF11EID11          __at(0x6BD3);	// @ (0xD7A * 8 + 3)
#define                                 RXF11EID11_bit      _BIT_ACCESS(RXF11EIDH,3)
// RXF11EIDH<RXF11EID12>
extern volatile __bit                   RXF11EID12          __at(0x6BD4);	// @ (0xD7A * 8 + 4)
#define                                 RXF11EID12_bit      _BIT_ACCESS(RXF11EIDH,4)
// RXF11EIDH<RXF11EID13>
extern volatile __bit                   RXF11EID13          __at(0x6BD5);	// @ (0xD7A * 8 + 5)
#define                                 RXF11EID13_bit      _BIT_ACCESS(RXF11EIDH,5)
// RXF11EIDH<RXF11EID14>
extern volatile __bit                   RXF11EID14          __at(0x6BD6);	// @ (0xD7A * 8 + 6)
#define                                 RXF11EID14_bit      _BIT_ACCESS(RXF11EIDH,6)
// RXF11EIDH<RXF11EID15>
extern volatile __bit                   RXF11EID15          __at(0x6BD7);	// @ (0xD7A * 8 + 7)
#define                                 RXF11EID15_bit      _BIT_ACCESS(RXF11EIDH,7)
// RXF11SIDL<RXF11EID16>
extern volatile __bit                   RXF11EID16          __at(0x6BC8);	// @ (0xD79 * 8 + 0)
#define                                 RXF11EID16_bit      _BIT_ACCESS(RXF11SIDL,0)
// RXF11SIDL<RXF11EID17>
extern volatile __bit                   RXF11EID17          __at(0x6BC9);	// @ (0xD79 * 8 + 1)
#define                                 RXF11EID17_bit      _BIT_ACCESS(RXF11SIDL,1)
// RXF11EIDL<RXF11EID2>
extern volatile __bit                   RXF11EID2           __at(0x6BDA);	// @ (0xD7B * 8 + 2)
#define                                 RXF11EID2_bit       _BIT_ACCESS(RXF11EIDL,2)
// RXF11EIDL<RXF11EID3>
extern volatile __bit                   RXF11EID3           __at(0x6BDB);	// @ (0xD7B * 8 + 3)
#define                                 RXF11EID3_bit       _BIT_ACCESS(RXF11EIDL,3)
// RXF11EIDL<RXF11EID4>
extern volatile __bit                   RXF11EID4           __at(0x6BDC);	// @ (0xD7B * 8 + 4)
#define                                 RXF11EID4_bit       _BIT_ACCESS(RXF11EIDL,4)
// RXF11EIDL<RXF11EID5>
extern volatile __bit                   RXF11EID5           __at(0x6BDD);	// @ (0xD7B * 8 + 5)
#define                                 RXF11EID5_bit       _BIT_ACCESS(RXF11EIDL,5)
// RXF11EIDL<RXF11EID6>
extern volatile __bit                   RXF11EID6           __at(0x6BDE);	// @ (0xD7B * 8 + 6)
#define                                 RXF11EID6_bit       _BIT_ACCESS(RXF11EIDL,6)
// RXF11EIDL<RXF11EID7>
extern volatile __bit                   RXF11EID7           __at(0x6BDF);	// @ (0xD7B * 8 + 7)
#define                                 RXF11EID7_bit       _BIT_ACCESS(RXF11EIDL,7)
// RXF11EIDH<RXF11EID8>
extern volatile __bit                   RXF11EID8           __at(0x6BD0);	// @ (0xD7A * 8 + 0)
#define                                 RXF11EID8_bit       _BIT_ACCESS(RXF11EIDH,0)
// RXF11EIDH<RXF11EID9>
extern volatile __bit                   RXF11EID9           __at(0x6BD1);	// @ (0xD7A * 8 + 1)
#define                                 RXF11EID9_bit       _BIT_ACCESS(RXF11EIDH,1)
// RXFCON1<RXF11EN>
extern volatile __bit                   RXF11EN             __at(0x6EAB);	// @ (0xDD5 * 8 + 3)
#define                                 RXF11EN_bit         _BIT_ACCESS(RXFCON1,3)
// RXF11SIDL<RXF11EXIDEN>
extern volatile __bit                   RXF11EXIDEN         __at(0x6BCB);	// @ (0xD79 * 8 + 3)
#define                                 RXF11EXIDEN_bit     _BIT_ACCESS(RXF11SIDL,3)
// RXF11SIDL<RXF11SID0>
extern volatile __bit                   RXF11SID0           __at(0x6BCD);	// @ (0xD79 * 8 + 5)
#define                                 RXF11SID0_bit       _BIT_ACCESS(RXF11SIDL,5)
// RXF11SIDL<RXF11SID1>
extern volatile __bit                   RXF11SID1           __at(0x6BCE);	// @ (0xD79 * 8 + 6)
#define                                 RXF11SID1_bit       _BIT_ACCESS(RXF11SIDL,6)
// RXF11SIDH<RXF11SID10>
extern volatile __bit                   RXF11SID10          __at(0x6BC7);	// @ (0xD78 * 8 + 7)
#define                                 RXF11SID10_bit      _BIT_ACCESS(RXF11SIDH,7)
// RXF11SIDL<RXF11SID2>
extern volatile __bit                   RXF11SID2           __at(0x6BCF);	// @ (0xD79 * 8 + 7)
#define                                 RXF11SID2_bit       _BIT_ACCESS(RXF11SIDL,7)
// RXF11SIDH<RXF11SID3>
extern volatile __bit                   RXF11SID3           __at(0x6BC0);	// @ (0xD78 * 8 + 0)
#define                                 RXF11SID3_bit       _BIT_ACCESS(RXF11SIDH,0)
// RXF11SIDH<RXF11SID4>
extern volatile __bit                   RXF11SID4           __at(0x6BC1);	// @ (0xD78 * 8 + 1)
#define                                 RXF11SID4_bit       _BIT_ACCESS(RXF11SIDH,1)
// RXF11SIDH<RXF11SID5>
extern volatile __bit                   RXF11SID5           __at(0x6BC2);	// @ (0xD78 * 8 + 2)
#define                                 RXF11SID5_bit       _BIT_ACCESS(RXF11SIDH,2)
// RXF11SIDH<RXF11SID6>
extern volatile __bit                   RXF11SID6           __at(0x6BC3);	// @ (0xD78 * 8 + 3)
#define                                 RXF11SID6_bit       _BIT_ACCESS(RXF11SIDH,3)
// RXF11SIDH<RXF11SID7>
extern volatile __bit                   RXF11SID7           __at(0x6BC4);	// @ (0xD78 * 8 + 4)
#define                                 RXF11SID7_bit       _BIT_ACCESS(RXF11SIDH,4)
// RXF11SIDH<RXF11SID8>
extern volatile __bit                   RXF11SID8           __at(0x6BC5);	// @ (0xD78 * 8 + 5)
#define                                 RXF11SID8_bit       _BIT_ACCESS(RXF11SIDH,5)
// RXF11SIDH<RXF11SID9>
extern volatile __bit                   RXF11SID9           __at(0x6BC6);	// @ (0xD78 * 8 + 6)
#define                                 RXF11SID9_bit       _BIT_ACCESS(RXF11SIDH,6)
// RXF12EIDL<RXF12EID0>
extern volatile __bit                   RXF12EID0           __at(0x6C18);	// @ (0xD83 * 8 + 0)
#define                                 RXF12EID0_bit       _BIT_ACCESS(RXF12EIDL,0)
// RXF12EIDL<RXF12EID1>
extern volatile __bit                   RXF12EID1           __at(0x6C19);	// @ (0xD83 * 8 + 1)
#define                                 RXF12EID1_bit       _BIT_ACCESS(RXF12EIDL,1)
// RXF12EIDH<RXF12EID10>
extern volatile __bit                   RXF12EID10          __at(0x6C12);	// @ (0xD82 * 8 + 2)
#define                                 RXF12EID10_bit      _BIT_ACCESS(RXF12EIDH,2)
// RXF12EIDH<RXF12EID11>
extern volatile __bit                   RXF12EID11          __at(0x6C13);	// @ (0xD82 * 8 + 3)
#define                                 RXF12EID11_bit      _BIT_ACCESS(RXF12EIDH,3)
// RXF12EIDH<RXF12EID12>
extern volatile __bit                   RXF12EID12          __at(0x6C14);	// @ (0xD82 * 8 + 4)
#define                                 RXF12EID12_bit      _BIT_ACCESS(RXF12EIDH,4)
// RXF12EIDH<RXF12EID13>
extern volatile __bit                   RXF12EID13          __at(0x6C15);	// @ (0xD82 * 8 + 5)
#define                                 RXF12EID13_bit      _BIT_ACCESS(RXF12EIDH,5)
// RXF12EIDH<RXF12EID14>
extern volatile __bit                   RXF12EID14          __at(0x6C16);	// @ (0xD82 * 8 + 6)
#define                                 RXF12EID14_bit      _BIT_ACCESS(RXF12EIDH,6)
// RXF12EIDH<RXF12EID15>
extern volatile __bit                   RXF12EID15          __at(0x6C17);	// @ (0xD82 * 8 + 7)
#define                                 RXF12EID15_bit      _BIT_ACCESS(RXF12EIDH,7)
// RXF12SIDL<RXF12EID16>
extern volatile __bit                   RXF12EID16          __at(0x6C08);	// @ (0xD81 * 8 + 0)
#define                                 RXF12EID16_bit      _BIT_ACCESS(RXF12SIDL,0)
// RXF12SIDL<RXF12EID17>
extern volatile __bit                   RXF12EID17          __at(0x6C09);	// @ (0xD81 * 8 + 1)
#define                                 RXF12EID17_bit      _BIT_ACCESS(RXF12SIDL,1)
// RXF12EIDL<RXF12EID2>
extern volatile __bit                   RXF12EID2           __at(0x6C1A);	// @ (0xD83 * 8 + 2)
#define                                 RXF12EID2_bit       _BIT_ACCESS(RXF12EIDL,2)
// RXF12EIDL<RXF12EID3>
extern volatile __bit                   RXF12EID3           __at(0x6C1B);	// @ (0xD83 * 8 + 3)
#define                                 RXF12EID3_bit       _BIT_ACCESS(RXF12EIDL,3)
// RXF12EIDL<RXF12EID4>
extern volatile __bit                   RXF12EID4           __at(0x6C1C);	// @ (0xD83 * 8 + 4)
#define                                 RXF12EID4_bit       _BIT_ACCESS(RXF12EIDL,4)
// RXF12EIDL<RXF12EID5>
extern volatile __bit                   RXF12EID5           __at(0x6C1D);	// @ (0xD83 * 8 + 5)
#define                                 RXF12EID5_bit       _BIT_ACCESS(RXF12EIDL,5)
// RXF12EIDL<RXF12EID6>
extern volatile __bit                   RXF12EID6           __at(0x6C1E);	// @ (0xD83 * 8 + 6)
#define                                 RXF12EID6_bit       _BIT_ACCESS(RXF12EIDL,6)
// RXF12EIDL<RXF12EID7>
extern volatile __bit                   RXF12EID7           __at(0x6C1F);	// @ (0xD83 * 8 + 7)
#define                                 RXF12EID7_bit       _BIT_ACCESS(RXF12EIDL,7)
// RXF12EIDH<RXF12EID8>
extern volatile __bit                   RXF12EID8           __at(0x6C10);	// @ (0xD82 * 8 + 0)
#define                                 RXF12EID8_bit       _BIT_ACCESS(RXF12EIDH,0)
// RXF12EIDH<RXF12EID9>
extern volatile __bit                   RXF12EID9           __at(0x6C11);	// @ (0xD82 * 8 + 1)
#define                                 RXF12EID9_bit       _BIT_ACCESS(RXF12EIDH,1)
// RXFCON1<RXF12EN>
extern volatile __bit                   RXF12EN             __at(0x6EAC);	// @ (0xDD5 * 8 + 4)
#define                                 RXF12EN_bit         _BIT_ACCESS(RXFCON1,4)
// RXF12SIDL<RXF12EXIDEN>
extern volatile __bit                   RXF12EXIDEN         __at(0x6C0B);	// @ (0xD81 * 8 + 3)
#define                                 RXF12EXIDEN_bit     _BIT_ACCESS(RXF12SIDL,3)
// RXF12SIDL<RXF12SID0>
extern volatile __bit                   RXF12SID0           __at(0x6C0D);	// @ (0xD81 * 8 + 5)
#define                                 RXF12SID0_bit       _BIT_ACCESS(RXF12SIDL,5)
// RXF12SIDL<RXF12SID1>
extern volatile __bit                   RXF12SID1           __at(0x6C0E);	// @ (0xD81 * 8 + 6)
#define                                 RXF12SID1_bit       _BIT_ACCESS(RXF12SIDL,6)
// RXF12SIDH<RXF12SID10>
extern volatile __bit                   RXF12SID10          __at(0x6C07);	// @ (0xD80 * 8 + 7)
#define                                 RXF12SID10_bit      _BIT_ACCESS(RXF12SIDH,7)
// RXF12SIDL<RXF12SID2>
extern volatile __bit                   RXF12SID2           __at(0x6C0F);	// @ (0xD81 * 8 + 7)
#define                                 RXF12SID2_bit       _BIT_ACCESS(RXF12SIDL,7)
// RXF12SIDH<RXF12SID3>
extern volatile __bit                   RXF12SID3           __at(0x6C00);	// @ (0xD80 * 8 + 0)
#define                                 RXF12SID3_bit       _BIT_ACCESS(RXF12SIDH,0)
// RXF12SIDH<RXF12SID4>
extern volatile __bit                   RXF12SID4           __at(0x6C01);	// @ (0xD80 * 8 + 1)
#define                                 RXF12SID4_bit       _BIT_ACCESS(RXF12SIDH,1)
// RXF12SIDH<RXF12SID5>
extern volatile __bit                   RXF12SID5           __at(0x6C02);	// @ (0xD80 * 8 + 2)
#define                                 RXF12SID5_bit       _BIT_ACCESS(RXF12SIDH,2)
// RXF12SIDH<RXF12SID6>
extern volatile __bit                   RXF12SID6           __at(0x6C03);	// @ (0xD80 * 8 + 3)
#define                                 RXF12SID6_bit       _BIT_ACCESS(RXF12SIDH,3)
// RXF12SIDH<RXF12SID7>
extern volatile __bit                   RXF12SID7           __at(0x6C04);	// @ (0xD80 * 8 + 4)
#define                                 RXF12SID7_bit       _BIT_ACCESS(RXF12SIDH,4)
// RXF12SIDH<RXF12SID8>
extern volatile __bit                   RXF12SID8           __at(0x6C05);	// @ (0xD80 * 8 + 5)
#define                                 RXF12SID8_bit       _BIT_ACCESS(RXF12SIDH,5)
// RXF12SIDH<RXF12SID9>
extern volatile __bit                   RXF12SID9           __at(0x6C06);	// @ (0xD80 * 8 + 6)
#define                                 RXF12SID9_bit       _BIT_ACCESS(RXF12SIDH,6)
// RXF13EIDL<RXF13EID0>
extern volatile __bit                   RXF13EID0           __at(0x6C38);	// @ (0xD87 * 8 + 0)
#define                                 RXF13EID0_bit       _BIT_ACCESS(RXF13EIDL,0)
// RXF13EIDL<RXF13EID1>
extern volatile __bit                   RXF13EID1           __at(0x6C39);	// @ (0xD87 * 8 + 1)
#define                                 RXF13EID1_bit       _BIT_ACCESS(RXF13EIDL,1)
// RXF13EIDH<RXF13EID10>
extern volatile __bit                   RXF13EID10          __at(0x6C32);	// @ (0xD86 * 8 + 2)
#define                                 RXF13EID10_bit      _BIT_ACCESS(RXF13EIDH,2)
// RXF13EIDH<RXF13EID11>
extern volatile __bit                   RXF13EID11          __at(0x6C33);	// @ (0xD86 * 8 + 3)
#define                                 RXF13EID11_bit      _BIT_ACCESS(RXF13EIDH,3)
// RXF13EIDH<RXF13EID12>
extern volatile __bit                   RXF13EID12          __at(0x6C34);	// @ (0xD86 * 8 + 4)
#define                                 RXF13EID12_bit      _BIT_ACCESS(RXF13EIDH,4)
// RXF13EIDH<RXF13EID13>
extern volatile __bit                   RXF13EID13          __at(0x6C35);	// @ (0xD86 * 8 + 5)
#define                                 RXF13EID13_bit      _BIT_ACCESS(RXF13EIDH,5)
// RXF13EIDH<RXF13EID14>
extern volatile __bit                   RXF13EID14          __at(0x6C36);	// @ (0xD86 * 8 + 6)
#define                                 RXF13EID14_bit      _BIT_ACCESS(RXF13EIDH,6)
// RXF13EIDH<RXF13EID15>
extern volatile __bit                   RXF13EID15          __at(0x6C37);	// @ (0xD86 * 8 + 7)
#define                                 RXF13EID15_bit      _BIT_ACCESS(RXF13EIDH,7)
// RXF13SIDL<RXF13EID16>
extern volatile __bit                   RXF13EID16          __at(0x6C28);	// @ (0xD85 * 8 + 0)
#define                                 RXF13EID16_bit      _BIT_ACCESS(RXF13SIDL,0)
// RXF13SIDL<RXF13EID17>
extern volatile __bit                   RXF13EID17          __at(0x6C29);	// @ (0xD85 * 8 + 1)
#define                                 RXF13EID17_bit      _BIT_ACCESS(RXF13SIDL,1)
// RXF13EIDL<RXF13EID2>
extern volatile __bit                   RXF13EID2           __at(0x6C3A);	// @ (0xD87 * 8 + 2)
#define                                 RXF13EID2_bit       _BIT_ACCESS(RXF13EIDL,2)
// RXF13EIDL<RXF13EID3>
extern volatile __bit                   RXF13EID3           __at(0x6C3B);	// @ (0xD87 * 8 + 3)
#define                                 RXF13EID3_bit       _BIT_ACCESS(RXF13EIDL,3)
// RXF13EIDL<RXF13EID4>
extern volatile __bit                   RXF13EID4           __at(0x6C3C);	// @ (0xD87 * 8 + 4)
#define                                 RXF13EID4_bit       _BIT_ACCESS(RXF13EIDL,4)
// RXF13EIDL<RXF13EID5>
extern volatile __bit                   RXF13EID5           __at(0x6C3D);	// @ (0xD87 * 8 + 5)
#define                                 RXF13EID5_bit       _BIT_ACCESS(RXF13EIDL,5)
// RXF13EIDL<RXF13EID6>
extern volatile __bit                   RXF13EID6           __at(0x6C3E);	// @ (0xD87 * 8 + 6)
#define                                 RXF13EID6_bit       _BIT_ACCESS(RXF13EIDL,6)
// RXF13EIDL<RXF13EID7>
extern volatile __bit                   RXF13EID7           __at(0x6C3F);	// @ (0xD87 * 8 + 7)
#define                                 RXF13EID7_bit       _BIT_ACCESS(RXF13EIDL,7)
// RXF13EIDH<RXF13EID8>
extern volatile __bit                   RXF13EID8           __at(0x6C30);	// @ (0xD86 * 8 + 0)
#define                                 RXF13EID8_bit       _BIT_ACCESS(RXF13EIDH,0)
// RXF13EIDH<RXF13EID9>
extern volatile __bit                   RXF13EID9           __at(0x6C31);	// @ (0xD86 * 8 + 1)
#define                                 RXF13EID9_bit       _BIT_ACCESS(RXF13EIDH,1)
// RXFCON1<RXF13EN>
extern volatile __bit                   RXF13EN             __at(0x6EAD);	// @ (0xDD5 * 8 + 5)
#define                                 RXF13EN_bit         _BIT_ACCESS(RXFCON1,5)
// RXF13SIDL<RXF13EXIDEN>
extern volatile __bit                   RXF13EXIDEN         __at(0x6C2B);	// @ (0xD85 * 8 + 3)
#define                                 RXF13EXIDEN_bit     _BIT_ACCESS(RXF13SIDL,3)
// RXF13SIDL<RXF13SID0>
extern volatile __bit                   RXF13SID0           __at(0x6C2D);	// @ (0xD85 * 8 + 5)
#define                                 RXF13SID0_bit       _BIT_ACCESS(RXF13SIDL,5)
// RXF13SIDL<RXF13SID1>
extern volatile __bit                   RXF13SID1           __at(0x6C2E);	// @ (0xD85 * 8 + 6)
#define                                 RXF13SID1_bit       _BIT_ACCESS(RXF13SIDL,6)
// RXF13SIDH<RXF13SID10>
extern volatile __bit                   RXF13SID10          __at(0x6C27);	// @ (0xD84 * 8 + 7)
#define                                 RXF13SID10_bit      _BIT_ACCESS(RXF13SIDH,7)
// RXF13SIDL<RXF13SID2>
extern volatile __bit                   RXF13SID2           __at(0x6C2F);	// @ (0xD85 * 8 + 7)
#define                                 RXF13SID2_bit       _BIT_ACCESS(RXF13SIDL,7)
// RXF13SIDH<RXF13SID3>
extern volatile __bit                   RXF13SID3           __at(0x6C20);	// @ (0xD84 * 8 + 0)
#define                                 RXF13SID3_bit       _BIT_ACCESS(RXF13SIDH,0)
// RXF13SIDH<RXF13SID4>
extern volatile __bit                   RXF13SID4           __at(0x6C21);	// @ (0xD84 * 8 + 1)
#define                                 RXF13SID4_bit       _BIT_ACCESS(RXF13SIDH,1)
// RXF13SIDH<RXF13SID5>
extern volatile __bit                   RXF13SID5           __at(0x6C22);	// @ (0xD84 * 8 + 2)
#define                                 RXF13SID5_bit       _BIT_ACCESS(RXF13SIDH,2)
// RXF13SIDH<RXF13SID6>
extern volatile __bit                   RXF13SID6           __at(0x6C23);	// @ (0xD84 * 8 + 3)
#define                                 RXF13SID6_bit       _BIT_ACCESS(RXF13SIDH,3)
// RXF13SIDH<RXF13SID7>
extern volatile __bit                   RXF13SID7           __at(0x6C24);	// @ (0xD84 * 8 + 4)
#define                                 RXF13SID7_bit       _BIT_ACCESS(RXF13SIDH,4)
// RXF13SIDH<RXF13SID8>
extern volatile __bit                   RXF13SID8           __at(0x6C25);	// @ (0xD84 * 8 + 5)
#define                                 RXF13SID8_bit       _BIT_ACCESS(RXF13SIDH,5)
// RXF13SIDH<RXF13SID9>
extern volatile __bit                   RXF13SID9           __at(0x6C26);	// @ (0xD84 * 8 + 6)
#define                                 RXF13SID9_bit       _BIT_ACCESS(RXF13SIDH,6)
// RXF14EIDL<RXF14EID0>
extern volatile __bit                   RXF14EID0           __at(0x6C58);	// @ (0xD8B * 8 + 0)
#define                                 RXF14EID0_bit       _BIT_ACCESS(RXF14EIDL,0)
// RXF14EIDL<RXF14EID1>
extern volatile __bit                   RXF14EID1           __at(0x6C59);	// @ (0xD8B * 8 + 1)
#define                                 RXF14EID1_bit       _BIT_ACCESS(RXF14EIDL,1)
// RXF14EIDH<RXF14EID10>
extern volatile __bit                   RXF14EID10          __at(0x6C52);	// @ (0xD8A * 8 + 2)
#define                                 RXF14EID10_bit      _BIT_ACCESS(RXF14EIDH,2)
// RXF14EIDH<RXF14EID11>
extern volatile __bit                   RXF14EID11          __at(0x6C53);	// @ (0xD8A * 8 + 3)
#define                                 RXF14EID11_bit      _BIT_ACCESS(RXF14EIDH,3)
// RXF14EIDH<RXF14EID12>
extern volatile __bit                   RXF14EID12          __at(0x6C54);	// @ (0xD8A * 8 + 4)
#define                                 RXF14EID12_bit      _BIT_ACCESS(RXF14EIDH,4)
// RXF14EIDH<RXF14EID13>
extern volatile __bit                   RXF14EID13          __at(0x6C55);	// @ (0xD8A * 8 + 5)
#define                                 RXF14EID13_bit      _BIT_ACCESS(RXF14EIDH,5)
// RXF14EIDH<RXF14EID14>
extern volatile __bit                   RXF14EID14          __at(0x6C56);	// @ (0xD8A * 8 + 6)
#define                                 RXF14EID14_bit      _BIT_ACCESS(RXF14EIDH,6)
// RXF14EIDH<RXF14EID15>
extern volatile __bit                   RXF14EID15          __at(0x6C57);	// @ (0xD8A * 8 + 7)
#define                                 RXF14EID15_bit      _BIT_ACCESS(RXF14EIDH,7)
// RXF14SIDL<RXF14EID16>
extern volatile __bit                   RXF14EID16          __at(0x6C48);	// @ (0xD89 * 8 + 0)
#define                                 RXF14EID16_bit      _BIT_ACCESS(RXF14SIDL,0)
// RXF14SIDL<RXF14EID17>
extern volatile __bit                   RXF14EID17          __at(0x6C49);	// @ (0xD89 * 8 + 1)
#define                                 RXF14EID17_bit      _BIT_ACCESS(RXF14SIDL,1)
// RXF14EIDL<RXF14EID2>
extern volatile __bit                   RXF14EID2           __at(0x6C5A);	// @ (0xD8B * 8 + 2)
#define                                 RXF14EID2_bit       _BIT_ACCESS(RXF14EIDL,2)
// RXF14EIDL<RXF14EID3>
extern volatile __bit                   RXF14EID3           __at(0x6C5B);	// @ (0xD8B * 8 + 3)
#define                                 RXF14EID3_bit       _BIT_ACCESS(RXF14EIDL,3)
